#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available_zones: Reading...
aws_default_vpc.default_vpc: Refreshing state... [id=vpc-0a409e69b5c85d10a]
aws_security_group.allow_mssql: Refreshing state... [id=sg-06dd54943508101b0]
data.aws_availability_zones.available_zones: Read complete after 1s [id=eu-west-1]
aws_default_subnet.subnet_az1: Refreshing state... [id=subnet-00451d8119d6fe90c]
aws_default_subnet.subnet_az2: Refreshing state... [id=subnet-0d254a33daed842df]
aws_db_instance.tutordb: Refreshing state... [id=db-QI4E4VTBAU7L5ZF6HUEARJD3J4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_db_instance.tutordb will be created
  + resource "aws_db_instance" "tutordb" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "sqlserver-ex"
      + engine_version                        = "14.00.3465.1.v1"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "tutordb"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "createdusing" = "Terraform"
          + "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
      + tags_all                              = {
          + "createdusing" = "Terraform"
          + "owner"        = "Umang.Vadadoriya@bbd.co.za"
        }
      + timezone                              = (known after apply)
      + username                              = (sensitive)
      + vpc_security_group_ids                = [
          + "sg-06dd54943508101b0",
        ]
    }

  # aws_security_group.allow_mssql will be updated in-place
  ~ resource "aws_security_group" "allow_mssql" {
        id                     = "sg-06dd54943508101b0"
        name                   = "allow_mssql"
      ~ tags                   = {
          - "Name"         = "allow_mssql" -> null
          ~ "createdusing" = "terraform-github" -> "Terraform"
          ~ "owner"        = "Umang-Vadadoriya@bbd.co.za" -> "Umang.Vadadoriya@bbd.co.za"
        }
      ~ tags_all               = {
          - "Name"         = "allow_mssql" -> null
          ~ "createdusing" = "terraform-github" -> "Terraform"
          ~ "owner"        = "Umang-Vadadoriya@bbd.co.za" -> "Umang.Vadadoriya@bbd.co.za"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Umang-Vadadoriya-BBD, Action: `pull_request`*